#ifndef PE1_AKAO_TRACK_H
#define PE1_AKAO_TRACK_H

typedef unsigned char AkaoU8;
typedef unsigned short AkaoU16;
typedef unsigned int AkaoU32;
typedef signed short AkaoS16;

typedef struct AkaoTrack {
    /* 0x000 */ AkaoU8 *pc;
    /* 0x004 */ AkaoU8 *call_stack[4];
    /* 0x014 */ AkaoU8 *branch_target;
    /* 0x018 */ AkaoU8 *repeat_target;
    /* 0x01C */ void *volume_lfo_table;
    /* 0x020 */ void *pan_lfo_table;
    /* 0x024 */ void *pitch_lfo_table;
    /* 0x028 */ AkaoU32 key_off_mask;
    /* 0x02C */ AkaoU32 key_on_mask;
    /* 0x030 */ AkaoU32 pitch_base;
    /* 0x034 */ AkaoU32 voice_mask_a;
    /* 0x038 */ AkaoU32 flags;
    /* 0x03C */ AkaoU32 voice_mask_b;
    /* 0x040 */ AkaoU32 pan_base;
    /* 0x044 */ int expression_value;
    /* 0x048 */ int expression_delta;
    /* 0x04C */ unsigned char pad_04C[0x06];
    /* 0x052 */ AkaoU16 field_52_duration;
    /* 0x054 */ AkaoU16 parent_track_id;
    /* 0x056 */ AkaoU16 field_56;
    /* 0x058 */ AkaoU16 pan_duration;
    /* 0x05A */ AkaoU16 note_pitch;
    /* 0x05C */ AkaoU16 voice_index;
    /* 0x05E */ AkaoU16 field_5E;
    /* 0x060 */ AkaoU16 field_60;
    /* 0x062 */ AkaoU16 repeat_counters[4];
    /* 0x06A */ AkaoS16 volume;
    /* 0x06C */ AkaoU16 volume_base;
    /* 0x06E */ AkaoU16 volume_duration;
    /* 0x070 */ AkaoU16 field_70;
    /* 0x072 */ AkaoU16 expression_duration;
    /* 0x074 */ AkaoU16 panpot_duration;
    /* 0x076 */ AkaoU16 panpot;
    /* 0x078 */ AkaoU16 panpot_slide_duration;
    /* 0x07A */ AkaoU16 field_7A;
    /* 0x07C */ AkaoU16 panpot_step;
    /* 0x07E */ AkaoU16 field_7E;
    /* 0x080 */ AkaoU16 field_80;
    /* 0x082 */ AkaoU16 field_82;
    /* 0x084 */ AkaoU16 field_84;
    /* 0x086 */ unsigned char pad_086[0x02];
    /* 0x088 */ AkaoU16 volume_lfo_delay;
    /* 0x08A */ AkaoU16 volume_lfo_counter;
    /* 0x08C */ AkaoU16 volume_lfo_duration;
    /* 0x08E */ AkaoU16 volume_lfo_phase;
    /* 0x090 */ AkaoU16 volume_lfo_selector;
    /* 0x092 */ AkaoU16 volume_lfo_depth;
    /* 0x094 */ AkaoU16 volume_lfo_target;
    /* 0x096 */ AkaoU16 volume_lfo_slide_duration;
    /* 0x098 */ AkaoS16 volume_lfo_delta;
    /* 0x09A */ AkaoS16 field_9A;
    /* 0x09C */ AkaoU16 pan_lfo_delay;
    /* 0x09E */ AkaoU16 pan_lfo_counter;
    /* 0x0A0 */ AkaoU16 pan_lfo_duration;
    /* 0x0A2 */ AkaoU16 pan_lfo_phase;
    /* 0x0A4 */ AkaoU16 pan_lfo_selector;
    /* 0x0A6 */ AkaoU16 pan_lfo_target;
    /* 0x0A8 */ AkaoU16 pan_lfo_slide_duration;
    /* 0x0AA */ AkaoS16 pan_lfo_delta;
    /* 0x0AC */ AkaoS16 field_AC;
    /* 0x0AE */ AkaoU16 pitch_lfo_duration;
    /* 0x0B0 */ AkaoU16 pitch_lfo_phase;
    /* 0x0B2 */ AkaoU16 pitch_lfo_selector;
    /* 0x0B4 */ AkaoU16 pitch_lfo_target;
    /* 0x0B6 */ AkaoU16 pitch_lfo_slide_duration;
    /* 0x0B8 */ AkaoS16 pitch_lfo_delta;
    /* 0x0BA */ AkaoU16 key_on_delay;
    /* 0x0BC */ AkaoU16 key_off_delay;
    /* 0x0BE */ unsigned char pad_0BE[0x10];
    /* 0x0CE */ AkaoU16 call_stack_index;
    /* 0x0D0 */ AkaoS16 field_D0;
    /* 0x0D2 */ AkaoS16 field_D2;
    /* 0x0D4 */ AkaoS16 volume_delta;
    /* 0x0D6 */ AkaoS16 field_D6;
    /* 0x0D8 */ AkaoS16 pan_target;
    /* 0x0DA */ AkaoS16 pan_delta;
    /* 0x0DC */ AkaoS16 panpot_delta;
    /* 0x0DE */ AkaoS16 expression;
    /* 0x0E0 */ AkaoS16 detune;
    /* 0x0E2 */ AkaoS16 field_E2;
    /* 0x0E4 */ AkaoS16 field_E4;
    /* 0x0E6 */ AkaoS16 field_E6;
    /* 0x0E8 */ AkaoS16 field_E8;
    /* 0x0EA */ AkaoS16 field_EA;
    /* 0x0EC */ AkaoS16 field_EC;
    /* 0x0EE */ unsigned char pad_0EE[0x06];
    /* 0x0F4 */ AkaoU32 update_flags;
    /* 0x0F8 */ AkaoU32 sample_header;
    /* 0x0FC */ AkaoU32 sample_data;
    /* 0x100 */ int adsr_attack;
    /* 0x104 */ int adsr_sustain;
    /* 0x108 */ int adsr_release;
    /* 0x10C */ unsigned char pad_10C[0x02];
    /* 0x10E */ AkaoU16 adsr_attack_rate;
    /* 0x110 */ AkaoU16 adsr_decay_rate;
    /* 0x112 */ AkaoU16 adsr_sustain_level;
    /* 0x114 */ AkaoU16 adsr_sustain_rate;
    /* 0x116 */ AkaoU16 adsr_release_rate;
} AkaoTrack;

typedef void (*AkaoTrackHandler)(AkaoTrack *track);

#endif
